app/controllers/api/notes_controller.rb

    def create

        @note = Note.new(note_params)

        if @note.save
---
INSERT INTO "notes" ("body", "title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdasdsad"], ["title", "asdasd"], ["created_at", "2020-09-28 14:58:48.119467"], ["updated_at", "2020-09-28 14:58:48.119467"], ["user_id", 14]]