app/controllers/api/notebooks_controller.rb

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @notebook = Notebook.includes(:notes).find(params[:id])

INSERT INTO "notebooks" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test id 31"], ["created_at", "2020-09-28 21:57:40.017280"], ["updated_at", "2020-09-28 21:57:40.017280"], ["user_id", 31]]
---
    def create

        @notebook = Notebook.new(notebook_params)


        if @notebook.save