app/models/user.rb

    def self.find_by_credentials(email, pw)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing"], ["LIMIT", 1]]